tap "adoptopenjdk/openjdk"
tap "gcenx/wine"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "jesseduffield/lazygit"
brew "anyenv"
brew "direnv"
brew "fzf"
brew "gcc"
brew "go"
brew "lazygit"
brew "lua-language-server"
brew "tree-sitter"
brew "neovim"
brew "nodebrew"
brew "openjdk@11"
brew "postgresql@14"
brew "pyenv"
brew "python@3.9"
brew "ripgrep"
brew "rust-analyzer"
brew "tmux"
brew "yarn"
cask "iterm2"
cask "keycastr"
cask "temurin11"
cask "temurin8"
cask "unofficial-wineskin"
